//IBMUSER JOB (FINANCE,2026),'HLASM SMF ENGINE',
//            NOTIFY=&SYSUID,MSGLEVEL=(1,1),MSGCLASS=A
//*--------------------------------------------
//* CONFIGURATION
//*--------------------------------------------
// SET SRC='IBMUSER.SRC'
// SET OBJ='IBMUSER.OBJ'
// SET LOAD='IBMUSER.LOAD'
// SET DB2MAC='DSNB10.SDSNMACS'
//*--------------------------------------------
//* INPUT / OUTPUT DATASETS
//*--------------------------------------------
// SET SMFIN='IBMUSER.SMF.FILE'
// SET JSONOUT='IBMUSER.JSON.EXPORT2'
//*--------------------------------------------
//* COMPILATION
//*--------------------------------------------
//ST1C3    EXEC ASMAC
//C.SYSLIN DD DISP=SHR,DSN=&OBJ(SMF2ZIIP)
//C.SYSIN  DD DISP=SHR,DSN=&SRC(SMF2ZIIP)
//C.SYSLIB DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=&DB2MAC
//         DD DISP=SHR,DSN=&SRC         
//*
//ST1C4    EXEC ASMAC
//C.SYSLIN DD DISP=SHR,DSN=&OBJ(SMF2JSON)
//C.SYSIN  DD DISP=SHR,DSN=&SRC(SMF2JSON)
//C.SYSLIB DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=&DB2MAC
//         DD DISP=SHR,DSN=&SRC
//*
//*ST1L     EXEC PGM=IEWL,PARM='MAP,LET,LIST,RENT,AC(1)',COND=(4,LT)
//*SYSLMOD  DD DISP=SHR,DSN=&LOAD
//*OBJLIB   DD DSN=&OBJ,DISP=SHR
//*SYSPRINT DD SYSOUT=*
//*SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//*SYSLIN   DD *
//*  INCLUDE OBJLIB(SMF2ZIIP)
//*  SETCODE AC(1)
//*  ENTRY SMF2ZIIP
//*  NAME SMF2ZIIP(R)
//*/*
//* 
//ST1L2    EXEC PGM=IEWL,PARM='MAP,LET,LIST,AC(1)',COND=(4,LT)
//SYSLMOD  DD DISP=SHR,DSN=&LOAD
//OBJLIB   DD DSN=&OBJ,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//SYSLIN   DD *
  INCLUDE OBJLIB(SMF2JSON)
  INCLUDE OBJLIB(SMF2ZIIP)
  SETCODE AC(1)
  ENTRY   START
  NAME    SMF2JSON(R)
/*
//*
//CLEAN    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=JCLONLY
  DELETE IBMUSER.JSON.EXPORT2
  SET MAXCC = 0
/*
//*
//ST1G     EXEC PGM=SMF2JSON,COND=(4,LT),TIME=(0,20)
//STEPLIB  DD DISP=SHR,DSN=&LOAD
//SMFFILE  DD DISP=SHR,DSN=&SMFIN
//JSONOUT  DD DISP=(NEW,CATLG,DELETE),DSN=&JSONOUT,
//* LRECL must match SMF2JSON JSONLREC (JSONBUFL+4) for expanded MAP30
//         UNIT=SYSALLDA,SPACE=(CYL,(1,5),RLSE),
//         DCB=(RECFM=VB,LRECL=8196,BLKSIZE=0)
//SNAP     DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
